fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРабот</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРабот.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРабот.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </attributes>
  <dimensions>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ПроцентОтРабот</name>
      <description>Процент от работ</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	Если НДФЛ = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Введите НДФЛ. Документ не проведен");
		Отказ = Истина;
	КонецЕсли;
	
	
	ОтпускЕсть = Ложь;
	
	СформироватьДвиженияОсновныеНачисленияУдержания(ОтпускЕсть, НДФЛ);
	
	РассчитатьОклад(НДФЛ);
	
	Если ОтпускЕсть Тогда
		РассчитатьОтпускные(НДФЛ);
	КонецЕсли;
	
	СформироватьДвижениеВзаиморасчетыССотрудниками();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныеНачисленияУдержания(ОтпускЕсть, НДФЛ)

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_НачисленияЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Специалист В
	|			(ВЫБРАТЬ
	|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|			ГДЕ
	|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Специалист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|			Специалист В
	|			(ВЫБРАТЬ
	|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|			ГДЕ
	|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Специалист
	|ГДЕ
	|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";

Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
Запрос.УстановитьПараметр("Период", Дата);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
Движения.ВКМ_Удержания.Записывать = Истина;

Пока Выборка.Следующий() Цикл
	
		// регистр ВКМ_ОсновныеНачисления
		ДвижениеОсновныеНачисления = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ДвижениеОсновныеНачисления.Сторно = Ложь;
		ДвижениеОсновныеНачисления.ВидРасчета = Выборка.ВидРасчета;
		ДвижениеОсновныеНачисления.ПериодРегистрации = Дата;
		ДвижениеОсновныеНачисления.ПериодДействияНачало = Выборка.ДатаНачала;
		ДвижениеОсновныеНачисления.ПериодДействияКонец = Выборка.ДатаОкончания;
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
		ДвижениеОсновныеНачисления.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Выборка.ДатаНачала, -12));
		ДвижениеОсновныеНачисления.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Выборка.ДатаОкончания, -1));
		ОтпускЕсть = Истина;
		КонецЕсли;
		ДвижениеОсновныеНачисления.Специалист = Выборка.Сотрудник;
		ДвижениеОсновныеНачисления.ГрафикРаботы = Выборка.ГрафикРаботы;
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			ДвижениеОсновныеНачисления.Показатель = Выборка.Оклад;
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот Тогда
			ДвижениеОсновныеНачисления.Результат = Выборка.СуммаКОплатеПриход;
		КонецЕсли;
			
		// регистр ВКМ_Удержания
		ДвижениеУдержания = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержания.Сторно = Ложь;
		ДвижениеУдержания.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержания.ПериодРегистрации = Дата;
		ДвижениеУдержания.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеУдержания.БазовыйПериодКонец = КонецМесяца(Дата);
		ДвижениеУдержания.Специалист = Выборка.Сотрудник;
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот Тогда
			ДвижениеУдержания.Результат = Выборка.СуммаКОплатеПриход * НДФЛ / 100;
		КонецЕсли;
		
КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры

Процедура РассчитатьОклад(НДФЛ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &Оклад
		|	И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// регистр ВКМ_ОсновныеНачисления
		ДвижениеОсновныеНачисления = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Если Выборка.Норма = 0 Тогда
			ДвижениеОсновныеНачисления.Результат = 0;
		КонецЕсли;
		
		ДвижениеОсновныеНачисления.Результат = ДвижениеОсновныеНачисления.Показатель * Выборка.Факт / Выборка.Норма;
		ДвижениеОсновныеНачисления.ОтработаноДней = Выборка.Факт;
		
		// регистр ВКМ_Удержания
		ДвижениеУдержания = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		ДвижениеУдержания.Результат = ДвижениеОсновныеНачисления.Результат * НДФЛ / 100;
		
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();	
	
	
КонецПроцедуры

Процедура РассчитатьОтпускные(НДФЛ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДнейБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерение, &Измерение,,
		|			Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Измерение = Новый Массив;
	Измерение.Добавить("Специалист");
	Запрос.УстановитьПараметр("Измерение", Измерение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвижениеОсновныеНачисления = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		ДвижениеОсновныеНачисления.Показатель = Выборка.РезультатБаза;
		ДвижениеОсновныеНачисления.ОтработаноДней = Выборка.Факт;
		
		Если Выборка.ОтработаноДнейБаза = 0 Тогда
			ДвижениеОсновныеНачисления.Результат = 0;
			Продолжить;
		КонецЕсли;
		
		ДвижениеОсновныеНачисления.Результат = Выборка.РезультатБаза * Выборка.Факт / Выборка.ОтработаноДнейБаза;
		
		ДвижениеУдержание = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		ДвижениеУдержание.Результат = ДвижениеОсновныеНачисления.Результат * НДФЛ / 100;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();	
	
КонецПроцедуры

Процедура СформироватьДвижениеВзаиморасчетыССотрудниками()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Специалист КАК Специалист,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК СуммаОсновныеНачисления,
		|	СУММА(ВКМ_Удержания.Результат) КАК СуммаУдержания
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ОсновныеНачисления.Специалист = ВКМ_Удержания.Специалист
		|		И ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_Удержания.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_Удержания.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Специалист";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
			// регистр ВКМ_ВзаиморасчетыССотрудниками
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Выборка.Специалист;
		Движение.Сумма = Выборка.СуммаОсновныеНачисления - Выборка.СуммаУдержания;
		
	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры


#КонецОбласти

#КонецЕсли
